
 //赋值时（输入），赋的是十进制，给的是原码。
 //如果赋值给的是八进制或者十六进制给的是补码
//打印时（输出），十进制打印要的是原码，如果是十六进制或八进制打印要的数补码

2 char ch = 0x82;
//补码：  1000 0010
//反码：  1111 1101
//原码：  1111 1110  = -126
	printf("%d\n",ch);

3 int num = 0x80 00 00 01;
//补码： 1000 0000 0000 0000 0000 0000 0000 0001
//反码： 1111 1111 1111 1111 1111 1111 1111 1110 
//原码： 1111 1111 1111 1111 1111 1111 1111 1111 = -7fffffff
	printf("%d\n",num);
	
4 char ch = -123;
	printf("%d\n",ch);
	
	
5 int num = 0xffffffff
//补码： 1111 1111 1111 1111 1111 1111 1111 1111
//反码： 1000 0000 0000 0000 0000 0000 0000 0000 
//原码:   1000 0000 0000 0000 0000 0000 0000 0001  = -1
	printf("%d\n",num);
6  unsigned  int num = 0xffffffff
	
	
	
	
	