1、八进制必须以_____开头，十六进制必须以_______开头。

2、标识符只能由_______、_______和_______组成。

3、在计算机中的进制表现形式有三种，分别是_____、 _______、 ________。

4、C 语言提供了 sizeof 运算符，该运算符主要用于________。

5、二进制和八进制相互转换
111 010 101 011 转换为八进制后结果为？
76321 转换为二进制结果为？

6、二进制和十六进制相互转换
1111 1010 1101 1011 转换为十六进制后结果为？
a6b2f1 转换为二进制结果为？

7、请写出-8的原码、反码、补码

8、可以使用计算器计算
short a = 0xfffe;
printf("%d\n", a); //结果为多少？

unsigned short a = 0xfffe;
printf("%u\n", a); //结果为多少？

short a = 0x7fff + 2;
printf("%d\n", a); //结果为多少？

unsigned short a = 0xffff + 5;
printf("%u\n", a); //结果为多少？

