#include "exti.h"
  /**************************************************************************
作者：平衡小车之家
我的淘宝小店：http://shop114407458.taobao.com/
**************************************************************************/
/**************************************************************************
函数功能：外部中断初始化
入口参数：无
返回  值：无 
**************************************************************************/
void Timer1_Init(u16 arr,u16 psc)  
{
	RCC->APB2ENR|=1<<11;//TIM1时钟使能    
 	TIM1->ARR=arr;      //设定计数器自动重装值   
	TIM1->PSC=psc;      //预分频器7200,得到10Khz的计数时钟
	TIM1->DIER|=1<<0;   //允许更新中断				
	TIM1->DIER|=1<<6;   //允许触发中断	   
	TIM1->CR1|=0x01;    //使能定时器
	MY_NVIC_Init(1,3,TIM1_UP_IRQn,2);
}
 

int TIM1_UP_IRQHandler(void)  
{    
	if(TIM1->SR&0X0001)//5ms定时中断
	{   
		   	TIM1->SR&=~(1<<0);   
			  
		if(++count_temp>1)  
		{
		count_temp=0;	
		temp++;
		temp2=temp;
    if(temp>30) temp=0,flag=!flag;			
		}
		if(flag)temp3=0;else temp3=7;
		   
		    
				LED=0;
	}       	
	 return 0;	  
} 






